# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "github/gh"
tap "heroku/brew"

# Brew CLI apps
brew "asciinema"
brew "diff-so-fancy"
brew "fzf"
brew "hugo"
brew "mas"
brew "node"
brew "netlify-cli", link: false
brew "ripgrep"
brew "starship"
brew "thefuck"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "vim"
brew "yadm"
brew "yarn"
brew "youtube-dl"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "devopsdays/tap/devopsdays-cli"
brew "github/gh/gh"
brew "heroku/brew/heroku"
brew "romkatv/powerlevel10k/powerlevel10k"

# App casks
cask "authy"
cask "discord"
cask "docker"
cask "firefox"
cask "obs"
cask "moom"
cask "postman"
cask "skype"
cask "slack"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "zoomus"

# Font casks
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-lg-nerd-font"

# Mac App Store apps
mas "Xcode", id: 497799835